Liang_etal/sixDofRigidBodyMotion_solver/0.2Mach_NACA0012/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    topAndBottom
    {
        type            patch;
        nFaces          160;
        startFace       100423;
    }
    inlet
    {
        type            patch;
        nFaces          122;
        startFace       100583;
    }
    outlet
    {
        type            patch;
        nFaces          122;
        startFace       100705;
    }
    wing
    {
        type            wall;
        inGroups        1(wall);
        nFaces          172;
        startFace       100827;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          50036;
        startFace       100999;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          50036;
        startFace       151035;
    }
)

// ************************************************************************* //
